Repository: melecajou/conanserverstatus
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: pt_br

source: Bot connected as {username}
pt_br: Bot conectado como {username}

source: All cogs loaded and tasks started.
pt_br: Todos os cogs foram carregados e as tarefas iniciadas.

source: Fatal error starting the bot: {error}
pt_br: Erro fatal ao iniciar o bot: {error}

source: Player tracker database '{db}' initialized successfully.
pt_br: Banco de dados de rastreamento de jogadores '{db}' inicializado com sucesso.

source: Failed to initialize player tracker database '{db}': {error}
pt_br: Falha ao inicializar o banco de dados de rastreamento de jogadores '{db}': {error}

source: Could not read player level from {db}: {error}
pt_br: Não foi possível ler o nível do jogador de {db}: {error}

source: Could not read player online time from {db}: {error}
pt_br: Não foi possível ler o tempo online do jogador de {db}: {error}

source: Player {player} on server '{server}' reached a new reward milestone at {hours:.1f} hours. Issuing reward.
pt_br: O jogador {player} no servidor '{server}' atingiu um novo marco de recompensa em {hours:.1f} horas. Emitindo recompensa.

source: Reward command '{cmd}' for player {player} on server '{server}' executed." " Response: {resp}
pt_br: Comando de recompensa '{cmd}' para o jogador {player} no servidor '{server}' executado. Resposta: {resp}

source: Failed to send reward RCON command for player {player} on server '{server}': {error}
pt_br: Falha ao enviar comando RCON de recompensa para o jogador {player} no servidor '{server}': {error}

source: An error occurred in track_and_reward_players for server '{server}': {error}
pt_br: Ocorreu um erro em track_and_reward_players para o servidor '{server}': {error}

source: The server is operating normally.
pt_br: O servidor está operando normalmente.

source: Online Players ({count})
pt_br: Jogadores Online ({count})

source: Online Players (0)
pt_br: Jogadores Online (0)

source: No one is playing at the moment.
pt_br: Ninguém está jogando no momento.

source: Uptime
pt_br: Tempo de Atividade

source: Server FPS
pt_br: FPS do Servidor

source: Memory
pt_br: Memória

source: Status updated
pt_br: Status atualizado

source: Failed to generate server status embed for '{server}': {error}
pt_br: Falha ao gerar embed de status do servidor para '{server}': {error}

source: [{server}] RCON connection successful on attempt {attempt}/3.
pt_br: [{server}] Conexão RCON bem-sucedida na tentativa {attempt}/3.

source: [{server}] RCON connection attempt {attempt}/3 failed: {error}
pt_br: [{server}] Tentativa de conexão RCON {attempt}/3 falhou: {error}

source: Channel with ID {channel_id} for '{server_name}' not found.
pt_br: Canal com ID {channel_id} para '{server_name}' não encontrado.

source: Could not connect to the server. It may be offline or restarting.
pt_br: Não foi possível conectar ao servidor. Pode estar desligado ou reiniciando.

source: Check the console or contact an administrator.
pt_br: Verifique o console ou contate um administrador.

source: Message for '{server}' not found. Creating a new one.
pt_br: Mensagem para '{server}' não encontrada. Criando uma nova.

source: Error updating status message for '{server}': {error}
pt_br: Erro ao atualizar mensagem de status para '{server}': {error}

source: Status update and reward task started.
pt_br: Tarefa de atualização de status e recompensa iniciada.

source: This command is being reworked. The bot updates automatically every minute.
pt_br: Este comando está sendo reformulado. O bot atualiza automaticamente a cada minuto.

source: Command on cooldown. Try again in {seconds:.1f} seconds.
pt_br: Comando em tempo de recarga. Tente novamente em {seconds:.1f} segundos.

source: Announcement task started.
pt_br: Tarefa de anúncio iniciada.

source: Building report task started.
pt_br: Tarefa de relatório de construções iniciada.

source: Scheduled announcement.
pt_br: Anúncio agendado.

source: Sent announcement for '{server_name}' to channel {channel_id}.
pt_br: Anúncio enviado para '{server_name}' no canal {channel_id}.

source: Could not find announcement channel with ID {channel_id} for server '{server_name}'.
pt_br: Não foi possível encontrar o canal de anúncio com ID {channel_id} para o servidor '{server_name}'.

source: Error in announcement task for server '{server_name}': {error}
pt_br: Erro na tarefa de anúncio para o servidor '{server_name}': {error}

source: Building Watcher for '{server_name}' is missing required configuration.
pt_br: O Observador de Construções para '{server_name}' está com a configuração incompleta.

source: Failed to generate building report for '{server_name}'. Exception: {error}
pt_br: Falha ao gerar relatório de construções para '{server_name}'. Exceção: {error}

source: Building Report - {server_name}
pt_br: Relatório de Construções - {server_name}

source: No buildings found at the moment.
pt_br: Nenhuma construção encontrada no momento.

source: (No Owner)
pt_br: (Sem Proprietário)

source: ⚠️ (Above the limit of {build_limit})
pt_br: ⚠️ (Acima do limite de {build_limit})

source: Updated
pt_br: Atualizado

source: Building report channel {channel_id} not found.
pt_br: Canal de relatório de construções {channel_id} não encontrado.

source: Building Report
pt_br: Relatório de Construções

source: Failed to post building report for '{server_name}': {error}
pt_br: Falha ao postar relatório de construções para '{server_name}': {error}

source: 🌍 Cluster Status
pt_br: 🌍 Status do Cluster

source: Consolidated status of all servers.
pt_br: Status consolidado de todos os servidores.

source: Total CPU
pt_br: CPU Total

source: Total Memory
pt_br: Memória Total

source: Cluster status updated
pt_br: Status do cluster atualizado
